
#pragma once

#include "Api.hpp"

// 테트리스 블럭들
const int tetris_pieces[7][4][4][4] {
    // piece one
    {
        {
            {0, 0, 0, 0},
            {2, 2, 2, 2},
            {0, 0, 0, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 2, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 0, 0, 0},
            {2, 2, 2, 2},
            {0, 0, 0, 0}
        },
        {
            {0, 2, 0, 0},
            {0, 2, 0, 0},
            {0, 2, 0, 0},
            {0, 2, 0, 0}
        }
    },
    // piece two
    {
        {
            {0, 0, 0, 0},
            {0, 2, 2, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 2, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 2, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 2, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        }
    },
    // piece three
    {
        {
            {0, 2, 0, 0},
            {0, 2, 0, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 2, 2},
            {0, 2, 0, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 2, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 0, 2, 0},
            {2, 2, 2, 0},
            {0, 0, 0, 0}
        }
    },
    // piece four
    {
        {
            {0, 0, 2, 0},
            {0, 0, 2, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 0, 0},
            {0, 2, 2, 2},
            {0, 0, 0, 0}
        },
        {
            {0, 2, 2, 0},
            {0, 2, 0, 0},
            {0, 2, 0, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {2, 2, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 0, 0}
        }
    },
    // piece five
    {
        { 
            {0, 2, 0, 0},
            {0, 2, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 0, 2, 2},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 0, 0},
            {0, 2, 2, 0},
            {0, 0, 2, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 2, 0},
            {2, 2, 0, 0},
            {0, 0, 0, 0}
        }
    },
    // piece six
    {
        { 
            {0, 0, 2, 0},
            {0, 2, 2, 0},
            {0, 2, 0, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 2, 2, 0},
            {0, 0, 2, 2},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 0, 0},
            {0, 0, 2, 0},
            {0, 2, 2, 0},
            {0, 2, 0, 0}
        },
        {
            {0, 0, 2, 0},
            {2, 2, 0, 0},
            {0, 2, 2, 0},
            {0, 0, 0, 0}
        }
    },
    // piece seven
    {
        { 
            {0, 0, 0, 0},
            {0, 2, 2, 2},
            {0, 0, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 2, 0},
            {0, 2, 2, 0},
            {0, 0, 2, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 2, 0},
            {0, 2, 2, 2},
            {0, 0, 0, 0},
            {0, 0, 0, 0}
        },
        {
            {0, 0, 2, 0},
            {0, 0, 2, 2},
            {0, 0, 2, 0},
            {0, 0, 0, 0}
        }
    }
};

static constexpr auto MAP_SIZE_X = 11;
static constexpr auto MAP_SIZE_Y = 21;

static constexpr auto FIRST_PIECE_X = MAP_SIZE_X / 2;
static constexpr auto FIRST_PIECE_Y = 0;

class Piece {
private:
    int x, y; // x좌표와 y좌표
    int pieceType;  // pieceType : 0 ~ 6 ( 1 ~ 7 )
    int pieceOrder; // pieceOrder : 1 ~ 4

public:
    int tetris_piece[4][4][4]; // tetris[piece_order][y][x]

    Piece(int pieceType) {
        this->pieceType = pieceType;

        // 기본 설정
        this->pieceOrder = 1;
        int x = FIRST_PIECE_X;
        int y = FIRST_PIECE_Y;

        // 블럭 저장
        for(int i = 0; i < 4; i++) {
            for(int j = 0; j < 4; j++) {
                for(int k = 0; k < 4; k++) {
                    this->tetris_piece[i][j][k] = tetris_pieces[this->pieceType][i][j][k];
                }
            }
        }
    }

    int 
    getX() {
        return this->x;
    }

    int 
    getY() {
        return this->y;
    }

    int getPieceType() {
        return this->pieceType;
    }

    int 
    getPieceOrder() {
        return this->pieceOrder;
    }
};